Repository: jaimetjr/find-pet-api
Catalog: Application/Resources/ValidationMessages.*.resx
Languages: pt_br

# ConfirmPasswordRequired
source: Confirm password is required
pt_br: Confirmação da senha é obrigatório

# EmailRequired
source: Email is required
pt_br: E-mail é obrigatório

# FieldLength100
source: Fields is to long. Max: 100
pt_br: Campo é de apenas 100 caracteres

# FieldLength200
source: Fields is to long. Max: 200
pt_br: Campo é de apenas 200 caracteres

# FieldLength300
source: Fields is to long. Max: 300
pt_br: Campo é de apenas 300 caracteres

# FieldLength500
source: Fields is to long. Max: 500
pt_br: Campo é de apenas 500 caracteres

# InvalidEmail
source: Email is not valid
pt_br: E-mail inváido

# NameRequired
source: Name is required
pt_br: Nome é obrigatório

# NameRequired1
source: Name is required
pt_br: Nome é obrigatório

# PasswordMinLength
source: Password must be 8 lenght long
pt_br: Senha tem que ser maior que 8 caracteres

# PasswordRequired
source: Password is required
pt_br: Senha é obrigatório

# PasswordsMustMatch
source: Passwords is not the same
pt_br: Senhas não concidem

# FieldLength30
source: Fields is to long. Max: 30
pt_br: Campo é de apenas 30 caracteres

# PhoneRequired
source: Phone is required
pt_br: Celular é obrigatório

source: User already exists
pt_br: Usuário já existe com o e-mail informado.

# PetNameRequired
source: Pet name is required
pt_br: Nome do pet é obrigatório

# PetNameLength
source: Pet name cannot exceed 100 characters
pt_br: Nome do pet não pode exceder 100 caracteres

# PetNameFormat
source: Pet name can only contain letters and spaces
pt_br: Nome do pet pode conter apenas letras e espaços

# AgeRequired
source: Age is required
pt_br: Idade é obrigatória

# AgeRange
source: Age must be between 1 and 30 years
pt_br: Idade deve estar entre 1 e 30 anos

# BioRequired
source: Bio is required
pt_br: Biografia é obrigatória

# HistoryRequired
source: History is required
pt_br: Histórico é obrigatório

# AddressRequired
source: Address is required
pt_br: Endereço é obrigatório

# NeighborhoodRequired
source: Neighborhood is required
pt_br: Bairro é obrigatório

# CityRequired
source: City is required
pt_br: Cidade é obrigatória

# StateRequired
source: State is required
pt_br: Estado é obrigatório

# CEPRequired
source: CEP is required
pt_br: CEP é obrigatório

# CEPFormat
source: CEP must be in format 12345-678 or 12345678
pt_br: CEP deve estar no formato 12345-678 ou 12345678

# NumberRequired
source: Number is required
pt_br: Número é obrigatório

# PetTypeRequired
source: Pet type is required
pt_br: Tipo do pet é obrigatório

# PetBreedRequired
source: Pet breed is required
pt_br: Raça do pet é obrigatória

# UserIdRequired
source: User ID is required
pt_br: ID do usuário é obrigatório

# ClerkIdRequired
source: Clerk ID is required
pt_br: ID do Clerk é obrigatório

# ProviderRequired
source: Provider is required
pt_br: Provedor é obrigatório

# CPFRequired
source: CPF is required
pt_br: CPF é obrigatório

# CPFFormat
source: CPF must be in format 123.456.789-01 or 12345678901
pt_br: CPF deve estar no formato 123.456.789-01 ou 12345678901

# BirthDateInvalid
source: Birth date cannot be in the future
pt_br: Data de nascimento não pode ser no futuro

# BirthDateRange
source: Birth date seems invalid
pt_br: Data de nascimento parece inválida

# PhoneFormat
source: Invalid phone number format
pt_br: Formato de telefone inválido

# FieldLength10
source: Field is too long. Max: 10
pt_br: Campo é muito longo. Máx: 10

# FieldLength50
source: Field is too long. Max: 50
pt_br: Campo é muito longo. Máx: 50

# FieldLength1000
source: Field is too long. Max: 1000
pt_br: Campo é muito longo. Máx: 1000
